#include <iostream>
using namespace std;
int main(){
    int a, b, c;
    cin >> a;
    cin >> b;
    cin >> c;
    if(((a % 10) * (a / 10)) <= ((a % 10) * (b / 10)) && ((a % 10) * (b / 10)) <= ((b % 10) * (b / 10))){
        cout << a << b;
    } else if(((b % 10) * (b / 10)) <= ((b % 10) * (a / 10)) && ((b % 10) * (a / 10)) <= ((a % 10) * (a / 10))){
        cout << b << a;
    } else if(((a % 10) * (a / 10)) <= ((a % 10) * (c / 10)) && ((a % 10) * (c / 10)) <= ((c % 10) * (c / 10))){
        cout << a << c;
    } else if(((c % 10) * (c / 10)) <= ((c % 10) * (a / 10)) && ((c % 10) * (a / 10)) <= ((a % 10) * (a / 10))){
        cout << c << a;
    } else if(((b % 10) * (b / 10)) <= ((b % 10) * (c / 10)) && ((b % 10) * (c / 10)) <= ((c % 10) * (c / 10))){
        cout << b << c;
    } else if(((c % 10) * (c / 10)) <= ((c % 10) * (b / 10)) && ((c % 10) * (b / 10)) <= ((b % 10) * (b / 10))){
        cout << c << b;
    } else {
        cout << "нет решений";
    }
}